var MainImg = document.getElementById("MainImg");
    var smalling = document.getElementsByClassName("small-image");
    smalling[0].onclick = function () {
    MainImg.src = smalling[0].src
    }
    smalling[1].onclick = function () {
      MainImg.src = smalling[1].src;
    }
    smalling[2].onclick = function () {
      MainImg.src = smalling[2].src;
    }
    smalling[3].onclick = function () {
      MainImg.src = smalling[3].src;
    }
    smalling[4].onclick = function () {
      MainImg.src = smalling[4].src;
    }
    const stateCities = {
  A01: ["أدرار", "أقبلي", "أوقروت", "أولاد أحمد تيمي", "أولاد عيسى ", "أولف", "إن زغمير", "إن زغمير", "بلديات ولاية أدرار", "بودة", "تامست", "تامنطيت", "تسابيت", "تيت", "تيمقتن", "رقان", "زاوية كنتة", "سالي", "عين بلبل","فنوغيل","قصبة لحرار",],
  A02: ["أبو الحسن", "الأبيض مجاجة", "أم الذروع","أولاد عباس","أولاد بن عبد القادر","أولاد فارس","بنايرية","بني بوعتاب","بريرة","بني حواء","بني راشد","بوزغاية","بوقادير","تاجنة","تلعصة","تاوقريت","تنس","الحجاج","حرشون","الزبوجة","سنجاس","سيدي عبد الرحمان","سيدي عكاشة","الشطية","الشلف","صبحة","الظهرة ","عين مران","الكريمية","المرسى","مصدق","الهرانفة","وادي الفضة","وادي سلي","وادي قوسين"],
  A03: ["قصر الحيران", "بن ناصر بن شهرة", "سيدي مخلوف","حاسي الدلاعة","حاسي الرمل","عين ماضي","تاجموت","الخنق","قلتة سيدي سعد","عين سيدي علي","البيضاء","بريدة","الغيشة","الحاج المشري","سبقاق","تاويالة","تاجرونة","أفلو","العسافية","وادي مرة","وادي مزي","الحويطة","سيدي بوزيد"],
  A04: ["أم البواقي", "أولاد حملة", "أولاد زواي","أولاد قاسم","لراحية","الضلعة","بئر الشهداء","بحير شرقي","بريش","البلالة","الجازية","الحرميلية","الزرق","سوق نعمان","سيقوس","العامرية","عين البيضاء","عين الديس","عين الزيتون ","عين بابوش","عين فكرون","عين كرشة","عين مليلة","الفجوج بوغرارة سعودي","فكرينة","قصر صباحي","مسكيانة","هنشير تومغني","وادي نيني"],
  A05: ["باتنة", "غسيرة", "معافة","مروانة","سريانة","منعة","المعذر","تازولت","نقاوس","القيقبة","إينوغيسن","عيون العصافير","جرمة","بيطام","عزيل عبد القادر","آريس","كيمل","تيلاطو","عين جاسر","أولاد سلام","وادي الماء","تيغرغار","عين ياقوت","سفيان","فسديس","الرحبات","تيغانمين","لمسان","قصر بلزمة","سقانة","إشمول","فم الطوب","بني فضالة الحقانية","تالخمت","بوزينة","الشمرة","وادي الشعبة","تاكسلانت"],
  A06: ["دائرة آدكار", "دائرة أقبو", "دائرة أميزور","دائرة أوقاس","دائرة برباشة","دائرة بجاية","دائرة بني معوش","دائرة شميني","دائرة درقينة","دائرة القصر","دائرة إغيل علي","دائرة خراطة","دائرة أوزلاقن","دائرة صدوق","دائرة سيدي عيش","دائرة سوق الاثنين","دائرة تازمالت","دائرة تيشي","دائرة تيمزريت"],
  A07: ["القنطرة", "سيدي عقبة (ولاية بسكرة)", "المزيرعة","الحوش","الحاجب","الفيض","ليوة","سيدي ","مخادمة","مليلي","الشعيبة","طولقة","زريبة الوادي","فوغالة","ليشانة","خنقة سيدي ناجي","برج بن عزوز",],
  A08: ["القنادسة","بني ونيف","لحمر","تاغيت","العبادلة","بني عباس","إقلي","الواتة","كرزاز","أولاد خضير","تبلبالة"],
  A09: ["أولاد السلامة", "أولاد يعيش", "البليدة","الأربعاء","بن خليل","بني تامو","بني مراد","بوعرفة","بوينان","بوفاريك","بوقرة","حمام ملوان","الجبابرة","الشبلي","الشريعة","الشفة","صوحان","الصومعة","العفرون","عين الرمانة","قرواو","مفتاح","موزاية","واد جر","وادي العلايق"],
  A10: ["البويرة", "آث منصور", "آيت لعزيز","الأخضرية","الأسنام","أغبالو","أهل القصر","أولاد راشد","بئر غبالو","برج أوخريص","بشلول","بودربالة","بوكرام","البويرة","تاغزوت","تاقديت","تيكجدة","الجباحية","الحاكمية","الحانيف","الحجرة الزرقاء","حيزر","الخبوزية","الدشمية","ديرة","الروراوة","ريدان","زبربر","سور الغزلان","سوق الخميس","الشرفة ","الصهاريج","العجيبة","عمر","عين الترك ","عين الحجر","عين العلوي","عين بسام","قادرية","قرومة","مسدور","لالة خديجة","مشد الله","معالة","المعمورة","المقراني","الهاشمية","وادي البردي"],
  A11: ["أبلسة", "إدلس", "أراك","أمقيد","أوتول","ازرنن","تاظروك","تاهيفت","تمنراست","تيت","سيلت","عين أمقل"],
  A12: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A13: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A14: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A15: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A16: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A17: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A18: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A19: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A20: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A21: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A22: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A23: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A24: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A25: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A26: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A27: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A28: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A29: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A30: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A31: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A32: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A33: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A34: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",],
  A35: ["Los Angeles", "San Francisco", "San Diego","","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",,"","","","","","","","","","",ر],
  A36: ["Los Angeles", "San Francisco", "San Diego"],
  A37: ["Los Angeles", "San Francisco", "San Diego"],
  A38: ["Los Angeles", "San Francisco", "San Diego"],
  A39: ["Los Angeles", "San Francisco", "San Diego"],
  A40: ["Los Angeles", "San Francisco", "San Diego"],
  A41: ["Los Angeles", "San Francisco", "San Diego"],
  A42: ["Los Angeles", "San Francisco", "San Diego"],
  A43: ["Los Angeles", "San Francisco", "San Diego"],
  A44: ["Los Angeles", "San Francisco", "San Diego"],
  A45: ["Los Angeles", "San Francisco", "San Diego"],
  A46: ["Los Angeles", "San Francisco", "San Diego"],
  A47: ["Los Angeles", "San Francisco", "San Diego"],
  A48: ["Los Angeles", "San Francisco", "San Diego"],
  A49: ["Los Angeles", "San Francisco", "San Diego"],
  A50: ["Los Angeles", "San Francisco", "San Diego"],
  A51: ["Los Angeles", "San Francisco", "San Diego"],
  A52: ["Los Angeles", "San Francisco", "San Diego"],
  A53: ["Los Angeles", "San Francisco", "San Diego"],
  A54: ["Los Angeles", "San Francisco", "San Diego"],
  A55: ["Los Angeles", "San Francisco", "San Diego"],
  A56: ["Los Angeles", "San Francisco", "San Diego"],
  A57: ["Los Angeles", "San Francisco", "San Diego"],
  A58: ["Los Angeles", "San Francisco", "San Diego"],
  
 
};

document.getElementById('state').addEventListener('change', function() {
  const state = this.value;
  const citySelect = document.getElementById('city');
  citySelect.disabled = !state;
  citySelect.innerHTML = '<option value="">Select a City</option>';

  if (state) {
    stateCities[state].forEach(function(city) {
      const option = document.createElement('option');
      option.value = city;
      option.textContent = city;
      citySelect.appendChild(option);
    });
  }
});

const addButton = document.getElementById('addImageAndTextAndButton');
const outerDiv = document.getElementById('outerDiv');

addButton.addEventListener('click', function() {
  const img = document.createElement('img');
  img.src = 'unnamed.jpg';
  img.alt = 'unnamed.jpg';
  img.style.width = '100px'; // fix the width to 200 pixels
  img.style.borderRadius = '20px'

  const textNode = document.createTextNode('2100DA');
  const textDiv = document.createElement('div');
  textDiv.appendChild(textNode);

 

  outerDiv.appendChild(img);
  outerDiv.appendChild(textDiv);
  
});

